sampleresults/aws-ec2-xfs/gp2-write-test.txt
rand-write-bs1m: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
rand-write-bs4k: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.27
Starting 2 processes
rand-write-bs1m: Laying out IO file (1 file / 1024MiB)
rand-write-bs4k: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1): [_(1),w(1)][100.0%][eta 00m:00s]
rand-write-bs1m: (groupid=0, jobs=1): err= 0: pid=4027: Sun Feb 26 10:51:23 2023
  write: IOPS=249, BW=249MiB/s (262MB/s)(15.0GiB/61581msec); 0 zone resets
    slat (usec): min=362, max=21815, avg=1220.23, stdev=2614.55
    clat (nsec): min=868, max=884784, avg=2128.10, stdev=8450.63
     lat (usec): min=364, max=21823, avg=1223.02, stdev=2615.99
    clat percentiles (nsec):
     |  1.00th=[   924],  5.00th=[   972], 10.00th=[  1012], 20.00th=[  1080],
     | 30.00th=[  1256], 40.00th=[  1464], 50.00th=[  1624], 60.00th=[  1816],
     | 70.00th=[  2064], 80.00th=[  2256], 90.00th=[  2960], 95.00th=[  4960],
     | 99.00th=[  6496], 99.50th=[ 12992], 99.90th=[ 46336], 99.95th=[ 69120],
     | 99.99th=[452608]
   bw (  KiB/s): min=22528, max=1660152, per=100.00%, avg=605352.29, stdev=529274.46, samples=52
   iops        : min=   22, max= 1621, avg=591.00, stdev=516.88, samples=52
  lat (nsec)   : 1000=8.52%
  lat (usec)   : 2=59.48%, 4=24.47%, 10=6.96%, 20=0.36%, 50=0.11%
  lat (usec)   : 100=0.07%, 250=0.01%, 500=0.01%, 1000=0.01%
  cpu          : usr=0.42%, sys=12.87%, ctx=15700, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15360,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-bs4k: (groupid=1, jobs=1): err= 0: pid=4038: Sun Feb 26 10:51:23 2023
  write: IOPS=48.0k, BW=188MiB/s (197MB/s)(11.0GiB/60029msec); 0 zone resets
    slat (usec): min=2, max=12553, avg= 6.06, stdev=163.12
    clat (nsec): min=606, max=3788.7k, avg=721.22, stdev=4730.14
     lat (usec): min=2, max=12564, avg= 6.84, stdev=163.25
    clat percentiles (nsec):
     |  1.00th=[  620],  5.00th=[  620], 10.00th=[  628], 20.00th=[  628],
     | 30.00th=[  636], 40.00th=[  644], 50.00th=[  644], 60.00th=[  644],
     | 70.00th=[  652], 80.00th=[  660], 90.00th=[  788], 95.00th=[  844],
     | 99.00th=[ 1128], 99.50th=[ 1560], 99.90th=[12480], 99.95th=[18560],
     | 99.99th=[79360]
   bw (  KiB/s): min= 3944, max=930264, per=100.00%, avg=443920.58, stdev=282000.94, samples=52
   iops        : min=  986, max=232566, avg=110980.06, stdev=70500.11, samples=52
  lat (nsec)   : 750=88.65%, 1000=9.82%
  lat (usec)   : 2=1.29%, 4=0.05%, 10=0.04%, 20=0.10%, 50=0.02%
  lat (usec)   : 100=0.02%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=6.09%, sys=17.74%, ctx=46151, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2883584,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=249MiB/s (262MB/s), 249MiB/s-249MiB/s (262MB/s-262MB/s), io=15.0GiB (16.1GB), run=61581-61581msec

Run status group 1 (all jobs):
  WRITE: bw=188MiB/s (197MB/s), 188MiB/s-188MiB/s (197MB/s-197MB/s), io=11.0GiB (11.8GB), run=60029-60029msec

Disk stats (read/write):
  nvme1n1: ios=0/341113, merge=0/28, ticks=0/1022646, in_queue=1022647, util=92.05%